zuorasoap/zuorasoap-connector/zuorasoap-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/zuorasoap/esbUpdateMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.zuora">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
        <urn:username>%s(username)</urn:username>
        <urn:password>%s(password)</urn:password>
        <urn:method>update</urn:method>
        <urn:updateObjects>
            <urn1:zObjects xsi:type="ns2:Account" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://object.api.zuora.com/" xmlns:urn1="http://api.zuora.com/">
                <ns2:Id>%s(id)</ns2:Id>
                <ns2:Name>%s(updateName)</ns2:Name>
            </urn1:zObjects>
        </urn:updateObjects>
    </soapenv:Body>
</soapenv:Envelope>